app/controllers/suppliers_controller.rb

  def show
    @supplier = Supplier.find(params[:id])
    @show_all = params["show_all"] || 'false'
    @products = @supplier.products
    @products = @products.where(active: true) if @show_all == 'false'
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = ? LIMIT 1  [["id", 14]]
SELECT `products`.* FROM `products` WHERE `products`.`supplier_id` = ? AND `products`.`active` = ?  [["supplier_id", 14], ["active", 1]]