app/controllers/users_controller.rb

  def index
    #@suppliers = Supplier.all
    @suppliers = Supplier.joins(:products).uniq.sort_by{|s| s.active}.reverse
---
SELECT DISTINCT `suppliers`.* FROM `suppliers` INNER JOIN `products` ON `products`.`supplier_id` = `suppliers`.`id`